//------------------------------------------------------------------------------
// machineLearning.csl
// These are also called evaluate operators
// Written by Taiob Ali
// SqlWorldWide.com
//------------------------------------------------------------------------------
// https://aka.ms/LADemo
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// basket plugin (https://docs.microsoft.com/en-us/azure/kusto/query/basketplugin)
//------------------------------------------------------------------------------

// Basket finds all frequent patterns of discrete attributes (dimensions) in the data 
// and will return all frequent patterns that passed the frequency threshold in the original query. 
// Association. Buying bread will most likely cuase buying butter, jam or egg.

// Basket is based on the Apriori algorithm originally developed for basket analysis data mining

// Here, we will do an analysis to see which combination of computer plus performance counters appears the most frequently

// copied from https://www.ciraltos.com/azure-machine-learning-in-log-analytics/

// You can pass a paremeter 'threshold' which
// Sets the minimal ratio of the rows to be considered frequent 
SecurityEvent
| where TimeGenerated >= ago(1d)
| project Account
        , Computer
        , Activity
        , LogonTypeName
| evaluate basket(0.10)

// You can also test basket in Azure data explorer 
// https://dataexplorer.azure.com/clusters/help/databases/Samples
// use the sample queries form
// https://docs.microsoft.com/en-us/azure/kusto/query/basketplugin

//------------------------------------------------------------------------------
// autocluster plugin (https://docs.microsoft.com/en-us/azure/kusto/query/autoclusterplugin)
//------------------------------------------------------------------------------

// AutoCluster finds common patterns of discrete attributes (dimensions) in the data 
// and will reduce the results of the original query (whether it's 100 or 100k rows) to a small number of patterns.
// AutoCluster was developed to help analyze failures (e.g. exceptions, crashes) 
// but can potentially work on any filtered data set

// https://www.ciraltos.com/azure-machine-learning-in-log-analytics/
// Add threshold optional parameter 0.10 and see the change in data
Update
| where TimeGenerated >= ago(1d)
| project Computer
        , UpdateState
        , Product
        , OSType
| evaluate autocluster()
